emacs.org
#+title: EMACS精简使用
* emacs的安装
** emacs组成
*** emacs安装包和依赖库
    emacs的安装包地址
    emacs的依赖库
** 64位emacs安装
*** 安装emacs
*** 安装依赖
*** emacs的安装
    配置字体生成.emacs文件和.emacs.d目录
    配置等宽字体
* emacs插件安装方式
** 指令安装
设置源
#+begin_src emacs-lisp
(setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                         ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))
(package-initialize) ;; You might already have this line
#+end_src
** 菜单方式安装
* spacemacs安装
** spacemacs安装
*** 设置清华源
#+begin_src emacs-lisp
(defun dotspacemacs/user-init ()
(setq configuration-layer--elpa-archives
    '(("melpa-cn" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
      ("org-cn"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
      ("gnu-cn"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")))
  )
#+end_src
*** 设置全屏
*** 设置logo
*** 设置neotree和编码字体
#+begin_src emacs-lisp
(setq projectile-switch-project-action 'neotree-projectile-action)
(setq neo-show-hidden-files nil)
(setq neo-smart-open t)
(global-set-key [f2] 'neotree-toggle)
(set-language-environment "UTF-8")
#+end_src
*** 指定安装包
#+begin_src emacs-lisp
(defun dotspacemacs/layers ()
  (setq-default
   dotspacemacs-additional-packages '(yasnippet)))
#+end_src
* golang开发环境安装
** 安装golang的支持
** 安装自动代码补全
** 安装HTML、javascript支持
** 环境变量设置
*** 设置系统变量
HOME
*** golang添加第三方支持
直接执行
#+begin_src go
go get -u -v golang.org/x/tools/cmd/gorename
go get -u -v golang.org/x/tools/cmd/guru
go get -u -v golang.org/x/tools/cmd/goimports
go get -u -v golang.org/x/tools/cmd/godoc
go get -u -v github.com/nsf/gocode
go get -u -v github.com/rogpeppe/godef
go get -u -v github.com/golang/lint/golint
go get -u -v github.com/lukehoban/go-find-references
go get -u -v sourcegraph.com/sqs/goreturns
go get -u -v github.com/derekparker/delve/cmd/dlv
go get -u -v github.com/alecthomas/gometalinter
go get -u -v github.com/zmb3/gogetdoc
go get -u -v github.com/lukehoban/go-outline
go get -u -v github.com/tpng/gopkgs
go get -u -v github.com/acroca/go-symbols
go get -u -v github.com/cweill/gotests/...
go get -u -v github.com/fatih/gomodifytags
go get -u -v github.com/monochromegane/the_platinum_searcher/...
#+end_src
下载库执行
#+begin_src go
go get golang.org/x/tools/cmd/gorename
go get golang.org/x/tools/cmd/guru
go get golang.org/x/tools/cmd/goimports
go get golang.org/x/tools/cmd/godoc
go get github.com/nsf/gocode
go get github.com/rogpeppe/godef
go get github.com/golang/lint/golint
go get github.com/lukehoban/go-find-references
go get sourcegraph.com/sqs/goreturns
go get github.com/derekparker/delve/cmd/dlv
go get github.com/alecthomas/gometalinter
go get github.com/zmb3/gogetdoc
go get github.com/lukehoban/go-outline
go get github.com/tpng/gopkgs
go get github.com/acroca/go-symbols
go get github.com/cweill/gotests/...
go get github.com/fatih/gomodifytags
go get github.com/monochromegane/the_platinum_searcher/...
#+end_src

#+begin_src sh
  gometalinter --install --update
#+end_src

#+begin_src emacs-lisp
  (setq gofmt-command "goimports")
#+end_src

*** 分设gopath
*** 显示菜单
#+begin_src sh
M+x menu
#+end_src
*** 快速查找指令
#+begin_src sh
M+x
#+end_src

* 拆包即用golang开发环境
[[https://coding.net/u/vker/p/tangram/git][Tangram
]]




















