emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-08 一 18:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EMACS简单使用</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">EMACS简单使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga93050f">1. emacs的安装</a>
<ul>
<li><a href="#orgfd17456">1.1. emacs组成</a>
<ul>
<li><a href="#org337421a">1.1.1. emacs安装包和依赖库</a></li>
</ul>
</li>
<li><a href="#org553c94e">1.2. 64位emacs安装</a>
<ul>
<li><a href="#orgebd0413">1.2.1. 安装emacs</a></li>
<li><a href="#org31240f2">1.2.2. 安装依赖</a></li>
<li><a href="#orgb18c418">1.2.3. emacs的安装</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0422a7b">2. emacs插件安装方式</a>
<ul>
<li><a href="#org7a01b04">2.1. 指令安装</a></li>
<li><a href="#orgdd8b6cc">2.2. 菜单方式安装</a></li>
</ul>
</li>
<li><a href="#org07d4690">3. spacemacs安装</a>
<ul>
<li><a href="#org06f1469">3.1. spacemacs安装</a>
<ul>
<li><a href="#orgdc63b48">3.1.1. 设置清华源</a></li>
<li><a href="#org327a80d">3.1.2. 设置全屏</a></li>
<li><a href="#orgc693ba4">3.1.3. 设置logo</a></li>
<li><a href="#orgebc1cdb">3.1.4. 设置neotree和编码字体</a></li>
<li><a href="#orga719453">3.1.5. 指定安装包</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org82e071c">4. golang开发环境安装</a>
<ul>
<li><a href="#org0efff6a">4.1. 安装golang的支持</a></li>
<li><a href="#org990dbba">4.2. 安装自动代码补全</a></li>
<li><a href="#org1f986ab">4.3. 安装HTML、javascript支持</a></li>
<li><a href="#org17b0262">4.4. 环境变量设置</a>
<ul>
<li><a href="#orgcee346d">4.4.1. 设置系统变量</a></li>
<li><a href="#orgac773ec">4.4.2. golang添加第三方支持</a></li>
<li><a href="#org37a58f9">4.4.3. 分设gopath</a></li>
<li><a href="#orged0bdbc">4.4.4. 显示菜单</a></li>
<li><a href="#orgda2a667">4.4.5. 快速查找指令</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1ca6ccc">5. 拆包即用golang开发环境</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga93050f" class="outline-2">
<h2 id="orga93050f"><span class="section-number-2">1</span> emacs的安装</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgfd17456" class="outline-3">
<h3 id="orgfd17456"><span class="section-number-3">1.1</span> emacs组成</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org337421a" class="outline-4">
<h4 id="org337421a"><span class="section-number-4">1.1.1</span> emacs安装包和依赖库</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
emacs的安装包地址
emacs的依赖库
</p>
</div>
</div>
</div>
<div id="outline-container-org553c94e" class="outline-3">
<h3 id="org553c94e"><span class="section-number-3">1.2</span> 64位emacs安装</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgebd0413" class="outline-4">
<h4 id="orgebd0413"><span class="section-number-4">1.2.1</span> 安装emacs</h4>
</div>
<div id="outline-container-org31240f2" class="outline-4">
<h4 id="org31240f2"><span class="section-number-4">1.2.2</span> 安装依赖</h4>
</div>
<div id="outline-container-orgb18c418" class="outline-4">
<h4 id="orgb18c418"><span class="section-number-4">1.2.3</span> emacs的安装</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
配置字体生成.emacs文件和.emacs.d目录
配置等宽字体
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org0422a7b" class="outline-2">
<h2 id="org0422a7b"><span class="section-number-2">2</span> emacs插件安装方式</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org7a01b04" class="outline-3">
<h3 id="org7a01b04"><span class="section-number-3">2.1</span> 指令安装</h3>
<div class="outline-text-3" id="text-2-1">
<p>
设置源
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>setq package-archives '<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"gnu"</span>   . <span style="color: #2d9574;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"</span><span style="color: #2d9574;">)</span>
                         <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"melpa"</span> . <span style="color: #2d9574;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>package-initialize<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">You might already have this line</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd8b6cc" class="outline-3">
<h3 id="orgdd8b6cc"><span class="section-number-3">2.2</span> 菜单方式安装</h3>
</div>
</div>
<div id="outline-container-org07d4690" class="outline-2">
<h2 id="org07d4690"><span class="section-number-2">3</span> spacemacs安装</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org06f1469" class="outline-3">
<h3 id="org06f1469"><span class="section-number-3">3.1</span> spacemacs安装</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgdc63b48" class="outline-4">
<h4 id="orgdc63b48"><span class="section-number-4">3.1.1</span> 设置清华源</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dotspacemacs/user-init</span> <span style="color: #bc6ec5;">()</span>
<span style="color: #bc6ec5;">(</span>setq configuration-layer--elpa-archives
    '<span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span><span style="color: #2d9574;">"melpa-cn"</span> . <span style="color: #2d9574;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #2d9574;">"org-cn"</span>   . <span style="color: #2d9574;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/org/"</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #2d9574;">"gnu-cn"</span>   . <span style="color: #2d9574;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org327a80d" class="outline-4">
<h4 id="org327a80d"><span class="section-number-4">3.1.2</span> 设置全屏</h4>
</div>
<div id="outline-container-orgc693ba4" class="outline-4">
<h4 id="orgc693ba4"><span class="section-number-4">3.1.3</span> 设置logo</h4>
</div>
<div id="outline-container-orgebc1cdb" class="outline-4">
<h4 id="orgebc1cdb"><span class="section-number-4">3.1.4</span> 设置neotree和编码字体</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>setq projectile-switch-project-action 'neotree-projectile-action<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>setq neo-show-hidden-files nil<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>setq neo-smart-open t<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>global-set-key <span style="color: #bc6ec5;">[</span>f2<span style="color: #bc6ec5;">]</span> 'neotree-toggle<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>set-language-environment <span style="color: #2d9574;">"UTF-8"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga719453" class="outline-4">
<h4 id="orga719453"><span class="section-number-4">3.1.5</span> 指定安装包</h4>
<div class="outline-text-4" id="text-3-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">dotspacemacs/layers</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #bc6ec5;">(</span>setq-default
   dotspacemacs-additional-packages '<span style="color: #2d9574;">(</span>yasnippet<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org82e071c" class="outline-2">
<h2 id="org82e071c"><span class="section-number-2">4</span> golang开发环境安装</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org0efff6a" class="outline-3">
<h3 id="org0efff6a"><span class="section-number-3">4.1</span> 安装golang的支持</h3>
</div>
<div id="outline-container-org990dbba" class="outline-3">
<h3 id="org990dbba"><span class="section-number-3">4.2</span> 安装自动代码补全</h3>
</div>
<div id="outline-container-org1f986ab" class="outline-3">
<h3 id="org1f986ab"><span class="section-number-3">4.3</span> 安装HTML、javascript支持</h3>
</div>
<div id="outline-container-org17b0262" class="outline-3">
<h3 id="org17b0262"><span class="section-number-3">4.4</span> 环境变量设置</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-orgcee346d" class="outline-4">
<h4 id="orgcee346d"><span class="section-number-4">4.4.1</span> 设置系统变量</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
HOME
</p>
</div>
</div>
<div id="outline-container-orgac773ec" class="outline-4">
<h4 id="orgac773ec"><span class="section-number-4">4.4.2</span> golang添加第三方支持</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
直接执行
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v golang.org/x/tools/cmd/gorename
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v golang.org/x/tools/cmd/guru
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v golang.org/x/tools/cmd/goimports
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v golang.org/x/tools/cmd/godoc
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/nsf/gocode
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/rogpeppe/godef
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/golang/lint/golint
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/lukehoban/<span style="color: #4f97d7; font-weight: bold;">go</span>-find-references
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v sourcegraph.com/sqs/goreturns
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/derekparker/delve/cmd/dlv
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/alecthomas/gometalinter
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/zmb3/gogetdoc
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/lukehoban/<span style="color: #4f97d7; font-weight: bold;">go</span>-outline
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/tpng/gopkgs
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/acroca/<span style="color: #4f97d7; font-weight: bold;">go</span>-symbols
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/cweill/gotests/...
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/fatih/gomodifytags
<span style="color: #4f97d7; font-weight: bold;">go</span> get -u -v github.com/monochromegane/the_platinum_searcher/...
</pre>
</div>
<p>
下载库执行
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">go</span> get golang.org/x/tools/cmd/gorename
<span style="color: #4f97d7; font-weight: bold;">go</span> get golang.org/x/tools/cmd/guru
<span style="color: #4f97d7; font-weight: bold;">go</span> get golang.org/x/tools/cmd/goimports
<span style="color: #4f97d7; font-weight: bold;">go</span> get golang.org/x/tools/cmd/godoc
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/nsf/gocode
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/rogpeppe/godef
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/golang/lint/golint
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/lukehoban/<span style="color: #4f97d7; font-weight: bold;">go</span>-find-references
<span style="color: #4f97d7; font-weight: bold;">go</span> get sourcegraph.com/sqs/goreturns
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/derekparker/delve/cmd/dlv
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/alecthomas/gometalinter
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/zmb3/gogetdoc
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/lukehoban/<span style="color: #4f97d7; font-weight: bold;">go</span>-outline
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/tpng/gopkgs
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/acroca/<span style="color: #4f97d7; font-weight: bold;">go</span>-symbols
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/cweill/gotests/...
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/fatih/gomodifytags
<span style="color: #4f97d7; font-weight: bold;">go</span> get github.com/monochromegane/the_platinum_searcher/...
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">gometalinter --install --update
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>setq gofmt-command <span style="color: #2d9574;">"goimports"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37a58f9" class="outline-4">
<h4 id="org37a58f9"><span class="section-number-4">4.4.3</span> 分设gopath</h4>
</div>
<div id="outline-container-orged0bdbc" class="outline-4">
<h4 id="orged0bdbc"><span class="section-number-4">4.4.4</span> 显示菜单</h4>
<div class="outline-text-4" id="text-4-4-4">
<div class="org-src-container">
<pre class="src src-sh">M+x menu
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda2a667" class="outline-4">
<h4 id="orgda2a667"><span class="section-number-4">4.4.5</span> 快速查找指令</h4>
<div class="outline-text-4" id="text-4-4-5">
<div class="org-src-container">
<pre class="src src-sh">M+x
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ca6ccc" class="outline-2">
<h2 id="org1ca6ccc"><span class="section-number-2">5</span> 拆包即用golang开发环境</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://coding.net/u/vker/p/tangram/git">Tangram
</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-08 一 18:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
